---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MinorLapSpliceLength
source: html/dfd6b271-06a8-4694-85b4-55dc6ad6cd49.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MinorLapSpliceLength Property

The lap splice length in the minor direction.

## Syntax (C#)
```csharp
public double MinorLapSpliceLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: minorLapSpliceLength is greater than the half of the overall width.